
<!-- FAQ -->
<link rel="stylesheet" href="css/blocks/faq.css">
<section class="faq">
    <div class="container">
        <div class="title">
            <h2>Вопросы и ответы</h2>
        </div>
        <div class="faq-item">
            <button class="faq-item__btn"><i class="ic ic-faq"></i> Установка свай под ключ на всех этапах производства работ, <br>от разметки до сдачи</button>
            <div class="faq-item__hidden">
                <div class="content">
                    <p>Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При
                        создании генератора мы использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в абзаце, что позволяет сделать текст более привлекательным и живым для
                        визуально-слухового восприятия.</p>
                </div>
            </div>
        </div>
        <div class="faq-item">
            <button class="faq-item__btn"><i class="ic ic-faq"></i> Грамотно составленный договор, обоснованная смета, четко выдержанные сроки</button>
            <div class="faq-item__hidden">
                <div class="content">
                    <p>Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При
                        создании генератора мы использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в абзаце, что позволяет сделать текст более привлекательным и живым для
                        визуально-слухового восприятия.</p>
                </div>
            </div>
        </div>
        <div class="faq-item">
            <button class="faq-item__btn"><i class="ic ic-faq"></i> Грамотно составленный договор, обоснованная смета, четко выдержанные сроки</button>
            <div class="faq-item__hidden">
                <div class="content">
                    <p>Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При
                        создании генератора мы использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в абзаце, что позволяет сделать текст более привлекательным и живым для
                        визуально-слухового восприятия.</p>
                </div>
            </div>
        </div>
        <div class="action-box">
            <a href="#" class="btn">задать свой вопрос</a>
        </div>
    </div>
</section>

<script>
    $(document).ready(function() {
        $('.faq-item__btn').click(function() {
            $(this).toggleClass('active');
            $(this).siblings('.faq-item__hidden').slideToggle();
        });
    });
</script>
<!-- FAQ END -->
